In [3]:
#commont imports
import pandas as pd
import numpy as np

Step 2 <a hrev='https://lab.karpov.courses/learning/85/module/1056/lesson/9039/26515/117790/'>link</a>

In [4]:
#path to data set file
#please note: it is defined on LMS but not local so we just define it here
path_to_file = '2_taxi_nyc.csv'

In [5]:
taxi = pd.read_csv(path_to_file)

Step 3 <a hrev='https://lab.karpov.courses/learning/85/module/1056/lesson/9039/26515/117791/'>link</a>

In [6]:
taxi.shape

(29101, 14)

Step 4 <a hrev='https://lab.karpov.courses/learning/85/module/1056/lesson/9039/26515/117792/'>link</a>

In [7]:
taxi.dtypes

pickup_dt        object
pickup_month     object
borough          object
pickups           int64
hday             object
spd             float64
vsb             float64
temp            float64
dewp            float64
slp             float64
pcp 01          float64
pcp 06          float64
pcp 24          float64
sd              float64
dtype: object

Step 5 <a hrev='https://lab.karpov.courses/learning/85/module/1056/lesson/9039/26515/117793/'>link</a>

In [8]:
def get_colums_to_rename(all_columns):
    '''
    all_columns - is array-like
    the method returns dic like {"old column name with spaces":"old_column_name_with_spaces"}
    '''
    return {key:key.replace(' ', '_') for key in all_columns if ' ' in key}

taxi = taxi.rename(columns=get_colums_to_rename(taxi.columns))

In [9]:
taxi.head()

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp_01,pcp_06,pcp_24,sd
0,2015-01-01 01:00:00,Jan,Bronx,152,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
2,2015-01-01 01:00:00,Jan,EWR,0,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
4,2015-01-01 01:00:00,Jan,Queens,405,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0

Step 6 <a hrev='https://lab.karpov.courses/learning/85/module/1056/lesson/9039/26515/117794/'>link</a>

In [10]:
taxi.value_counts('borough')

borough
Bronx            4343
Brooklyn         4343
EWR              4343
Manhattan        4343
Queens           4343
Staten Island    4343
dtype: int64

In [11]:
taxi.query("borough == 'Brooklyn'").shape[0]

4343

In [12]:
taxi.borough.value_counts()

Manhattan        4343
Staten Island    4343
Bronx            4343
Queens           4343
Brooklyn         4343
EWR              4343
Name: borough, dtype: int64

Step 7 <a hrev='https://lab.karpov.courses/learning/85/module/1056/lesson/9039/26515/117795/'>link</a>

In [13]:
total_pickups = taxi.pickups.sum()

In [14]:
total_pickups

14265773

Step 8 <a hrev='https://lab.karpov.courses/learning/85/module/1056/lesson/9039/26515/117796/'>link</a>

In [15]:
taxi.borough.isna().sum()

3043

In [16]:
pickups_by_borough = taxi.groupby(by='borough', as_index=False, dropna=False) \
    .agg({'pickups':'sum'}) \
    .sort_values('pickups', ascending=False)

In [17]:
pickups_by_borough.pickups.sum()

14265773

In [18]:
pickups_by_borough

         borough   pickups
3      Manhattan  10367841
1       Brooklyn   2321035
4         Queens   1343528
0          Bronx    220047
5  Staten Island      6957
6            NaN      6260
2            EWR       105

Step 9 <a hrev='https://lab.karpov.courses/learning/85/module/1056/lesson/9039/26515/117797/'>link</a>

In [19]:
#help(pickups_by_borough.idxmin)

pickups_by_borough = taxi \
    .groupby(by='borough', as_index=False, dropna=False) \
    .agg({'pickups':'sum'})

min_index = pickups_by_borough.pickups.idxmin(axis='columns', skipna=True)

min_pickups = pickups_by_borough.borough[min_index]

Step 10 <a hrev='https://lab.karpov.courses/learning/85/module/1056/lesson/9039/26515/117798/'>link</a>

In [21]:
picksup_by_hday = taxi \
    .groupby(by=['borough', 'hday'], as_index=False, dropna=False) \
    .agg({'pickups':'mean'}) \
    .sort_values(['borough', 'hday'], ascending=False)

In [22]:
picksup_by_hday.head()

          borough hday      pickups
11  Staten Island    Y     1.497006
10  Staten Island    N     1.606082
9          Queens    Y   320.730539
8          Queens    N   308.899904
7       Manhattan    Y  2035.928144

In [50]:
picksup_by_hday \
    .groupby(by='borough', as_index=False) \
    .agg(lambda x: x[x.hday == 'Y'].pickups.values > x[x.hday == 'N'].pickups.values)

         borough   hday  pickups
0          Bronx  False    False
1       Brooklyn  False    False
2            EWR   True     True
3      Manhattan  False    False
4         Queens   True     True
5  Staten Island  False    False

In [52]:
picksup_by_hday.pivot(columns='hday', values='pickups', index='borough').query('Y > N')

hday              N           Y
borough
EWR        0.023467    0.041916
Queens   308.899904  320.730539

In [53]:
taxi.pivot_table(index='borough', columns='hday', values='pickups', aggfunc='mean')

hday                     N            Y
borough
Bronx            50.771073    48.065868
Brooklyn        534.727969   527.011976
EWR               0.023467     0.041916
Manhattan      2401.302921  2035.928144
Queens          308.899904   320.730539
Staten Island     1.606082     1.497006

Step 11 <a hrev='https://lab.karpov.courses/learning/85/module/1056/lesson/9039/26515/117799/'>link</a>

In [64]:
pickups_by_mon_bor = taxi \
    .groupby(by=['borough', 'pickup_month'], as_index=False, dropna=True) \
    .agg({'pickups':'sum'}) \
    .sort_values('pickups', ascending=False)

In [65]:
pickups_by_mon_bor.head()

      borough pickup_month  pickups
21  Manhattan          Jun  1995388
23  Manhattan          May  1888800
19  Manhattan          Feb  1718571
22  Manhattan          Mar  1661261
18  Manhattan          Apr  1648278

Step 12 <a hrev='https://lab.karpov.courses/learning/85/module/1056/lesson/9039/26515/117800/'>link</a>

In [69]:
def temp_to_celcius(faringates):
    return (faringates - 32.0) * 5.0/9.0

In [70]:
taxi['temp_C'] = temp_to_celcius(taxi.temp)

In [71]:
taxi.temp_C

0        -1.111111
1        -1.111111
2        -1.111111
3        -1.111111
4        -1.111111
           ...
29096    23.888889
29097    23.888889
29098    23.888889
29099    23.888889
29100    23.888889
Name: temp_C, Length: 29101, dtype: float64